INSERT INTO `role`(`name`) VALUES('站长');
INSERT INTO `role`(`name`) VALUES('副站长');
INSERT INTO `role`(`name`) VALUES('超级管理员');
INSERT INTO `role`(`name`) VALUES('社区管理员');
INSERT INTO `role`(`name`) VALUES('资源管理员');
INSERT INTO `role`(`name`) VALUES('文章管理员');
INSERT INTO `role`(`name`) VALUES('晨读管理员');
INSERT INTO `role`(`name`) VALUES('高级会员');
INSERT INTO `role`(`name`) VALUES('中级会员');
INSERT INTO `role`(`name`) VALUES('初级会员');

INSERT INTO `authority` (`aid`, `name`, `menu1`, `menu2`, `route`, `op_user`, `ctime`, `mtime`)
VALUES
	(1, '用户管理', 0, 0, '', '', '2014-08-17 11:06:50', '2014-08-16 10:51:13'),
	(2, '权限管理', 1, 0, '/admin/user/auth/list', '', '2014-08-17 11:06:50', '2014-08-16 12:05:55'),
	(3, '权限查询', 1, 2, '/admin/user/auth/query.html', '', '2014-08-17 11:06:50', '2014-08-17 11:06:50'),
	(4, '新建权限', 1, 2, '/admin/user/auth/new', '', '2014-08-17 11:06:50', '2014-08-17 21:18:56'),
	(5, '修改权限', 1, 2, '/admin/user/auth/modify', '', '2014-08-18 23:56:11', '2014-10-04 23:16:31'),
	(6, '删除权限', 1, 2, '/admin/user/auth/del', '', '2014-08-17 22:12:30', '2014-08-17 22:12:30'),
	(7, '角色管理', 1, 0, '/admin/user/role/list', '', '2014-08-17 23:03:40', '2014-08-17 23:03:40'),
	(8, '角色查询', 1, 7, '/admin/user/role/query.html', '', '2014-08-18 23:54:44', '2014-08-18 23:54:44'),
	(9, '新建角色', 1, 7, '/admin/user/role/new', '', '2014-08-18 23:55:10', '2014-08-18 23:55:10'),
	(10, '修改角色', 1, 7, '/admin/user/role/modify', '', '2014-08-18 23:55:24', '2014-08-18 23:55:24'),
	(11, '删除角色', 1, 7, '/admin/user/role/del', '', '2014-08-18 23:57:20', '2014-08-18 23:57:44'),
	(12, '用户管理', 1, 0, '/admin/user/user/list', '', '2014-08-19 00:20:41', '2014-08-19 00:20:41'),
	(13, '用户查询', 1, 12, '/admin/user/user/query.html', '', '2014-08-19 08:43:55', '2014-08-19 08:43:55'),
	(14, '用户详情', 1, 12, '/admin/user/user/detail', '', '2014-08-19 21:14:07', '2014-08-19 21:14:07'),
	(15, '社区管理', 0, 0, '', '', '2014-09-03 21:18:10', '2014-09-03 21:18:10'),
	(16, '帖子管理', 15, 0, '/admin/community/topic/list', '', '2014-09-03 22:23:08', '2014-09-03 22:23:08'),
	(17, '帖子查询', 15, 16, '/admin/community/topic/query.html', '', '2014-09-04 07:28:33', '2014-09-04 07:28:33'),
	(18, '帖子修改', 15, 16, '/admin/community/topic/modify', '', '2014-09-04 22:42:47', '2014-09-04 22:42:47'),
	(19, '抓取管理', 0, 0, '', '', '2014-09-08 11:24:08', '2014-09-08 11:24:08'),
	(20, '文章管理', 19, 0, '/admin/crawl/article/list', '', '2014-09-08 11:24:39', '2014-09-08 11:24:39'),
	(21, '规则管理', 19, 0, '/admin/crawl/rule/list', '', '2014-09-08 11:50:19', '2014-09-08 11:50:19'),
	(22, '文章修改', 19, 20, '/admin/crawl/article/modify', '', '2014-09-30 09:07:44', '2014-09-30 09:07:44'),
	(23, '文章删除', 19, 20, '/admin/crawl/article/del', '', '2014-09-30 09:09:01', '2014-09-30 09:09:01'),
	(24, '新建规则', 19, 21, '/admin/crawl/rule/new', '', '2014-10-04 01:19:42', '2014-10-04 01:19:41'),
	(25, '抓取文章', 19, 20, '/admin/crawl/article/new', '', '2014-10-05 00:02:41', '2014-10-05 00:02:40'),
	(26, '文章查询', 19, 20, '/admin/crawl/article/query.html', '', '2014-10-05 08:08:48', '2014-10-05 08:08:47'),
	(27, '修改规则', 19, 21, '/admin/crawl/rule/modify', '', '2014-10-20 23:14:37', '2014-10-20 23:14:33'),
	(28, '晨读管理', 0, 0, '', '', '2014-10-30 22:53:30', '2014-10-30 22:53:24'),
	(29, '晨读列表', 28, 0, '/admin/reading/list', '', '2014-10-30 22:53:53', '2014-10-30 22:53:47'),
	(30, '晨读查询', 28, 29, '/admin/reading/query.html', '', '2014-10-30 22:54:11', '2014-10-30 22:54:05'),
	(31, '发布晨读', 28, 29, '/admin/reading/publish', '', '2014-10-30 22:54:28', '2014-10-30 22:54:22'),
	(32, '管理工具', 0, 0, '', '', '2014-11-02 11:43:19', '2014-11-02 11:43:13'),
	(33, '生成Sitemap', 32, 0, '/admin/tool/sitemap', '', '2014-11-02 11:43:41', '2014-11-02 11:43:35'),
	(34, '项目管理', 15, 0, '/admin/community/project/list', '', '2014-11-03 21:54:48', '2014-11-03 21:54:42'),
	(35, '项目查询', 15, 34, '/admin/community/project/query.html', '', '2014-11-03 21:55:07', '2014-11-03 21:55:01'),
	(36, '项目上下线', 15, 34, '/admin/community/project/update_status', '', '2014-11-03 21:55:26', '2014-11-03 21:55:19'),
	(37, '规则查询', 19, 21, '/admin/crawl/rule/query.html', '', '2014-11-08 12:38:20', '2014-11-08 12:38:13'),
	(38, '用户修改', 1, 12, '/admin/user/user/modify', '', '2015-07-14 13:53:53', '2015-07-14 13:53:53');

INSERT INTO `topics_node` (`nid`, `parent`, `name`, `intro`, `ctime`)
VALUES
	(1, 0, 'Golang', 'Go语言基本问题探讨', '2013-03-15 14:38:09'),
	(2, 1, 'Go基础', 'Go语言基础、语法、规范等', '2013-03-15 14:38:09'),
	(3, 1, 'Go标准库', 'Go语言标准库使用、例子、源码等', '2013-03-15 14:38:09'),
	(4, 1, 'Go源码', '深入Go语言内部实现，分享Go语言源码学习心得', '2013-03-15 14:38:09'),
	(5, 1, 'Go Web开发', '用Go语言进行Web开发', '2013-03-15 14:38:09'),
	(6, 1, 'Go问与答', '任何关于Go语言的问题都可以到这里提', '2013-03-15 14:38:09'),
	(7, 1, 'Go动态', 'Go语言相关资讯和最新动态', '2013-03-15 14:38:09'),
	(8, 1, 'Go开发工具', '交流Go开发工具的使用', '2013-03-15 14:38:09'),
	(9, 0, '开源控', 'Golang本身开源，自然gopher们都是开源控', '2013-03-15 14:38:09'),
	(10, 9, 'Go Web框架', '开源的Go Web框架，你知道多少？使用了吗？', '2013-03-15 14:38:09'),
	(11, 9, 'Go第三方库', '第三方Go库，你都用了哪些？', '2013-03-15 14:38:09'),
	(12, 9, 'Go代码分享', '和gopher们分享您自己的Go代码吧', '2013-03-15 14:38:09'),
	(13, 9, 'Go资料', '好多Go语言资料啊，学习学习……', '2013-03-15 14:38:09'),
	(14, 0, 'Study Golang', 'Golang China，Go语言学习园地，中文社区', '2013-03-15 14:38:09'),
	(15, 14, '社区公告', '社区最新动态、公共以及其他信息', '2013-03-15 14:38:09'),
	(16, 14, '反馈', '使用过程中遇到了问题，可以在这里提交', '2013-03-15 14:38:09'),
	(17, 14, '社区开发', '对开发该社区感兴趣的可以一起加入进来哦', '2013-03-15 14:38:09'),
	(18, 0, '分享', '分享生活、学习、工作等方方面面', '2013-03-18 18:02:21'),
	(19, 18, 'Markdown', '当下Markdown是相当火，本站就使用Markdown发帖，有必要聊聊它的使用', '2013-03-18 18:05:08'),
	(20, 1, 'Go实战', 'Go语言实际使用经验交流', '2013-03-20 17:43:00'),
	(21, 1, 'Go工具链', '(go tool chain)Go提供的各种工具学习、使用', '2013-05-09 16:23:57'),
	(22, 18, '招聘', '发布Go语言招聘信息', '2013-10-23 20:56:38'),
	(23, 18, '杂谈', 'Go相关或不太相关的杂谈', '2014-04-02 22:39:07'),
	(24, 0, '其他语言', '非Go语言的相关交流', '2016-04-09 09:06:30'),
	(25, 24, 'Python交流', '关于Python语言的交流', '2016-04-09 09:06:49');

INSERT INTO `resource_category` (`catid`, `name`, `intro`, `ctime`)
VALUES
	(1, '精彩文章', '分享来自互联网关于Go语言的精彩文章', '2013-03-23 20:23:29'),
	(2, '开源项目', '收集优秀的开源项目、第三方库', '2013-03-23 20:23:29'),
	(3, 'Go语言资料', 'Go语言书籍、资料，提供下载地址或在线链接', '2013-03-23 20:23:29'),
	(4, '其他资源', '分享跟Go相关或其他有用的资源', '2013-03-25 23:35:07');

